Revit 2027 API
FilterInverseRule.SetInnerRule Method
 Gets the rule being inverted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetInnerRule(
	FilterRule innerRule
)
Public Sub SetInnerRule (
	innerRule As FilterRule
)
public:
void SetInnerRule(
	FilterRule^ innerRule
)
member SetInnerRule :
        innerRule : FilterRule -> unit
Parameters
innerRule FilterRule
 The rule to invert.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterInverseRule Class
Autodesk.Revit.DB Namespace